// Вычислить значение формулы , где a,b,c,d – некоторые
// 𝑎×𝑏 𝑐+𝑑 целые числа. Результат вывести на экран.

int a = 5;
int b = 6;
int c = 8;
double d = 3;

int product = a * b;
double quotient = c / d;

double fraction = product / quotient;
System.Console.WriteLine(product);
System.Console.WriteLine(quotient);
System.Console.WriteLine(fraction);

